Repository: EmptiedSoul/hpkg
Catalog: po/*.po
Languages: ru

source: Failing due to previous warnings
ru: Выхожу ввиду предыдущих сообщений

source: This is
ru: Это

source: from
ru: из

source: C implementation
ru: реализация на языке Си

source: version
ru: версия

source: Arseniy 'EmptiedSoul' Lesin
ru: Арсений 'EmptiedSoul' Лесин

source: License: GPLv3 or newer: <https://gnu.org/licenses>
ru: Лицензия: GPLv3 или новее: <https://gnu.org/licenses>

source: This is free software: you can freely run, inspect, modify and distribute this program
ru: Это свободное ПО: вы можете свободно запускать, изучать, изменять и распространять эту программу

source: NO WARRANTY AT ALL
ru: НИКАКИХ ГАРАНТИЙ НЕ ПРЕДОСТАВЛЯЕТСЯ

source: hpkg-info - obtain information about .hard package
ru: hpkg-info - получить информацию о пакете .hard

source: hpkg-info [options] -p <package>
ru: hpkg-info [опции] -p <пакетик>

source: Options
ru: Опции

source: Print version info and exit
ru: Вывести информацию о версии и выйти

source: Print this help
ru: Вывести этот текст

source: Dump entire METADATA file
ru: Вывести файл METADATA целиком

source: Print as "KEY=VALUE"
ru: Выводить в формате: КЛЮЧ=ЗНАЧЕНИЕ

source: -k <key1,key2>
ru: -k <ключ1,ключ2>

source: --keys=<key1,key2>
ru: --keys=<ключ1,ключ2>

source: Specify key to obtain
ru: Указать ключ для вывода

source: -o <file>
ru: -o <файл>

source: --output <file>
ru: --output <файл>

source: Specify output (default stdout)
ru: Указать куда перенаправить вывод (по-умолчанию на терминал)

source: More information available at hpkg-info(1) manpage
ru: Больше информации доступно на man-странице hpkg-info(1)

source: Copyright and licensing information can be obtained via '--version' option
ru: Информация о авторском праве и лицензировании может быть получена с помощью опции '--version'

source: hpkg-explode - extract .hard package
ru: hpkg-explode - распаковать пакет .hard

source: hpkg-explode [options] -p <package>
ru: hpkg-explode [опции] -p <пакетик>

source: Be verbose
ru: Подробный режим

source: Be silent
ru: Тихий режим

source: Also extract PAYLOAD.tar.zst
ru: Также распаковать PAYLOAD.tar.zst

source: -C <directory>
ru: -C <директория>

source: --directory=<directory>
ru: --directory <директория>

source: Extract to <directory>
ru: Распаковать в <директорию>

source: -p <package>
ru: -p <пакетик>

source: --package=<package>
ru: --package=<пакетик>

source: Specify package to extract
ru: Указать пакет для распаковки

source: More information available at hpkg-explode(1) manpage
ru: Больше информации доступно на man-странице hpkg-explode(1)

source: Option
ru: Опция

source: requires
ru: требует

source: <directory> argument
ru: аргумент <директория>

source: Consult a manpage or '--help' option
ru: Обратитесь к man-странице или опции '--help'

source: <package> argument
ru: аргумент <пакетик>

source: Unknown option
ru: Неизвестная опция

source: Package is not set
ru: Пакет не указан

source: is not a .hard package
ru: не является пакетом .hard

source: %s is a valid .hard package
ru: %s является пакетом .hard

source: Directory: %s
ru: Директория: %s

source: %s is encrypted, decrypting...
ru: %s зашифрован, расшифровываю...

source: Creating directory...
ru: Создаю директорию

source: Failed to create directory: %s: %s
ru: Не удалось создать директорию: %s: %s

source: Extracting %s...
ru: Распаковываю %s...

source: Writing %s/METADATA
ru: Записываю %s/METADATA

source: Writing %s/PAYLOAD.tar.zst
ru: Записываю %s/PAYLOAD.tar.zst

source: Closing %s
ru: Закрываю %s

source: Option '--recursive' was not passed. Exiting
ru: Опция '--recursive' не была дана. Завершаю работу

source: Creating directory %s/PAYLOAD...
ru: Создаю директорию %s/PAYLOAD...

source: Extracting %s/PAYLOAD.tar.zst...
ru: Распаковываю %s/PAYLOAD.tar.zst

source: Failed to read PAYLOAD.tar.zst
ru: Не удалось прочесть PAYLOAD.tar.zst

source: Fatal error occured while extracting PAYLOAD.tar.zst
ru: Произошла фатальная ошибка во время распаковки PAYLOAD.tar.zst

source: Removing %s/PAYLOAD.tar.zst
ru: Удаляю %s/PAYLOAD.tar.zst

source: <key> argument
ru: аргумент <ключ>

source: <file> argument
ru: параметр <file>

source: You should specify a key to obtain
ru: Вы должны указать ключ для получения

source: hpkg - install .hard package
ru: hpkg - установить пакет .hard

source: hpkg [options] -p <package>
ru: hpkg [опции] -p <пакетик>

source: Install as dependency
ru: Установить как зависимость

source: Disable hooks
ru: Отменить выполнение хуков

source: Do not resolve dependencies and conflicts
ru: Не разрешать зависимости и конфликты

source: Do not verify package
ru: Не проверять подлинность пакета

source: Do not really install package
ru: Не устанавливать пакет на самом деле

source: Install in <directory>
ru: Установить в <директорию>

source: Specify package to install
ru: Указать пакет для установки

source: More information available at hpkg(8) manpage
ru: Больше информации доступно на man-странице hpkg(8)

source: No such package
ru: Нет такого пакета

source: You need root permissions for this action
ru: Вам необходимы права администратора для этого действия

source: Reading metadata
ru: Читаю метаданные

source: Package can not be verified
ru: Пакет не может быть верифицирован

source: Package is corrupted
ru: Пакет поврежден

source: Dependency tracking disabled
ru: Отслеживание зависимостей отключено

source: Can not resolve dependency
ru: Не могу разрешить зависимость

source: needed for
ru: необходимую для

source: Conflict
ru: Конфликт

source: Running 'pkg_preinstall'
ru: Запускаю 'pkg_preinstall'

source: 'pkg_preinstall' exited with non-zero code
ru: 'pkg_preinstall' завершился с ошибкой

source: Installing package
ru: Устанавливаю пакет

source: Running hooks
ru: Запускаю хуки

source: Hook exited with non-zero code
ru: Хук завершился с ошибкой

source: Running 'pkg_postinstall'
ru: Запускаю 'pkg_postinstall'

source: 'pkg_postinstall' exited with non-zero code
ru: 'pkg_postinstall' завершился с ошибкой

source: Print this text
ru: Вывести этот текст

source: is corrupted
ru: поврежден

source: Moving to
ru: Перемещаю в

source: <file> argurment
ru: аргумент <файл>

source: Consult a manpage or `--help' option
ru: Обратитесь к man-странице или опции '--help'

source: hpkg-remove - uninstall .hard package
ru: hpkg-remove - удалить пакет .hard

source: hpkg-remove [options] -p <package>
ru: hpkg-remove [опции] -p <пакетик>

source: Ignore dependencies and conflicts
ru: Игнорировать зависимости и конфликты

source: Do not really remove package
ru: Не удалять пакет на самом деле

source: Remove from <directory>
ru: Удалить из <директории>

source: Specify package to remove
ru: Укажите пакет для удаления

source: More information available at hpkg-remove(8) manpage
ru: Больше информации доступно на man-странице hpkg-remove(8)

source: Package is not installed so not removed
ru: Пакет не будет удалён, так как он не был установлен

source: Following packages depend on
ru: Следующие пакеты зависят от

source: Cannot remove package due to dependency breakage
ru: Невозможно удалить пакет, так как это вызовет разрыв зависимости

source: Removing package...
ru: Удаляю пакет...

source: hpkg-make - create .hard package
ru: hpkg-make - создать пакет .hard

source: hpkg-make <command>
ru: hpkg-make <команды>

source: Commands
ru: Команды

source: Read Buildfile and build package
ru: Собрать пакет в соответствии с Buildfile

source: <directory>
ru: <директория>

source: Create package from given directory
ru: Создать пакет из указанной директории

source: Clean build and destination directories
ru: Очистить директорию сборки и назначения

source: Like 'clean' but keep destination directory
ru: Как 'clean', только сохранить директорию назначения

source: Completely purge everyrhing related to package
ru: Полностью очистить все связаное с пакетом

source: Install built package
ru: Установить собраный пакет

source: More information available at hpkg-make(1) manpage
ru: Больше информации доступно на man-странице hpkg-make(1)

source: Cannot read Buildfile
ru: Не могу прочитать Buildfile

source: Invalid Buildfile
ru: Некорректный Buildfile

source: Running getsrc()
ru: Запускаю getsrc()

source: Failed to get sources
ru: Не удалось получить исходники

source: Running unpacksrc()
ru: Запускаю unpacksrc()

source: Failed to unpack sources
ru: Не удалось распаковать исходники

source: Running preparesrc()
ru: Запускаю preparesrc()

source: Failed to prepare sources
ru: Не удалось подготовить исходники

source: Entering chroot environment
ru: Вхожу в окружение chroot

source: Running compilesrc()
ru: Запускаю compilesrc()

source: Failed to compile sources
ru: Не удалось скомпилировать исходники

source: Running installsrc()
ru: Запускаю installsrc()

source: Failed to install into package
ru: Установка в пакет не удалась

source: Stripping
ru: Очищаю ненужные секции бинарников

source: Failed to strip
ru: Не удалось произвести зачистку бинарников

source: Creating package
ru: Создаю пакет

source: Failed to create package
ru: Не удалось создать пакет

source: Leaving chroot environment
ru: Покидаю окружение chroot

source: Signing package
ru: Подписываю пакет

source: Can not read Buildfile
ru: Не могу прочитать Buildfile

source: Can not read METADATA
ru: Не могу прочитать метаданные

source: Can not install package
ru: Не могу установить пакет

source: hardman - high-level package managing utility
ru: hardman - высокоуровневая утилита для управления пакетами

source: hardman [command]
ru: hardman [команда]

source: More information available at hardman(8) manpage
ru: Больше информации доступно на man-странице hardman(8)

source: No such command, maybe you mistyped it or appropriate module isnt enabled.
ru: Нет такой команды, возможно вы опечатались или подходящий модуль не подключён

source: Use '--help' to obtain full list of commands
ru: Используйте опцию '--help', чтобы получить полный список команд

source: No such module
ru: Нет такого модуля

source: hparts - hardman' module manager
ru: hparts - менеджер модулей hardman

source: More information available at hparts(8) manpage
ru: Больше информации доступно на man-странице hparts(8)

source: Downloading
ru: Загрузка

source: Failed to download package
ru: Не удалось загрузить пакет

source: Usage
ru: Использование

source: No such package in repository
ru: В репозитории не такого пакета

source: The following packages will be installed
ru: Следующие пакеты будут установлены

source: Do you wish to continue?
ru: Хотите продолжить?

source: Failed to read repo.conf!
ru: Не удалось прочитать repo.conf!

source: Repository is not set. Have you configured your /etc/hardman/repo.conf?
ru: Репозиторий не указан. Вы настроили /etc/hardman/repo.conf?

source: Retrieving repository metadata...
ru: Получение метаданных репозитория

source: Failed to retrieve repository metadata
ru: Не удалось получить метаданные репозитория

source: Installing repository metadata...
ru: Устанавливаю метаданные репозитория

source: Failed to install repository metadata
ru: Не удалось установить метаданные репозитория
